tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Platform built on V8 to build network applications
brew "node"
# Cross-shell prompt for astronauts
brew "starship"
# Programmatically correct mistyped console commands
brew "thefuck"
# Internet file retriever
brew "wget"
# Universal database tool and SQL client
cask "dbeaver-community"
# Java IDE by JetBrains
cask "intellij-idea", args: { appdir: "~/Applications" }
# Collaboration platform for API development
cask "postman"
# Rust-based terminal
cask "warp"
vscode "0h7z.vscode-julia-format"
vscode "atommaterial.a-file-icon-vscode"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "golang.go"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-es"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "RandomFractalsInc.vscode-data-preview"
vscode "tal7aouy.rainbow-bracket"
vscode "unclebeast.har-viewer"
